Revit 2027 API
ExportDGNSettings.SetDGNExportOptions Method
 Sets the options stored in these settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDGNExportOptions(
	DGNExportOptions options
)
Public Sub SetDGNExportOptions (
	options As DGNExportOptions
)
public:
void SetDGNExportOptions(
	DGNExportOptions^ options
)
member SetDGNExportOptions :
        options : DGNExportOptions -> unit
Parameters
options DGNExportOptions
 The options.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportDGNSettings Class
Autodesk.Revit.DB Namespace